package com.kaos.skynet.api.data.enums;

import com.kaos.skynet.core.type.Enum;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * 最小费用编码，统计小类 {@code COM_DICTIONARY#TYPE = MINFEE}
 */
@AllArgsConstructor
public enum MinFeeEnum implements Enum {
    西药("001", "西药"), 中成药("002", "中成药"), 中草药("003", "中草药"), 诊查费("004", "诊查费"), 空调冷暖费("005", "空调冷暖费"), 会诊费("006", "会诊费"),
    护理费("007", "护理费"), 治疗费("008", "治疗费"), 氧气费("009", "氧气费"), 出诊费("010", "出诊费"), 换药费("011", "换药费"), 手术费("012", "手术费"),
    手术材料("013", "手术材料"), 麻醉监护("014", "麻醉监护"), 放射费("015", "放射费"), 磁共振("016", "磁共振"), CT("017", "CT"), 彩超("018", "彩超"),
    TCD("019", "TCD"), B超("020", "B超"), 心电图("021", "心电图"), 核检查("022", "核检查"), 核治疗("023", "核治疗"), ECT("024", "ECT"),
    放疗费("025", "放疗费"), 粒子植入("027", "粒子植入"), 化验费("028", "化验费"), 病理费("030", "病理费"), 脑电图("031", "脑电图"), 肌电图("032", "肌电图"),
    高压氧("033", "高压氧"), 纤支镜("034", "纤支镜"), 肺功能("035", "肺功能"), 胃镜("036", "胃镜"), 床位费("037", "床位费"), 结肠镜("038", "结肠镜"),
    直肠镜("039", "直肠镜"), 尿动力("040", "尿动力"), 血液透析("041", "血液透析"), 介入("042", "介入"), 针灸("043", "针灸"), 理疗("044", "理疗"),
    接生费("045", "接生费"), 手术中用药("046", "手术中用药"), 体检费("048", "体检费"), 儿童急诊("049", "儿童急诊"), 成人急诊("050", "成人急诊"),
    废物处置费("051", "废物处置费"), 保健对象费("060", "保健对象费"), 自制药品("061", "自制药品"), 卫材费("996", "卫材费"), 输血费("998", "输血费");

    /**
     * 数据库存值
     */
    @Getter
    private String value;

    /**
     * 描述存值
     */
    @Getter
    private String description;
}
